Revit 2027 API
Panel.GetRefGridLines Method
 This method is used to get the reference gridlines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void GetRefGridLines(
	ref ElementId uGridLineId,
	ref ElementId vGridLineId
)
Public Sub GetRefGridLines (
	ByRef uGridLineId As ElementId,
	ByRef vGridLineId As ElementId
)
public:
void GetRefGridLines(
	ElementId^% uGridLineId,
	ElementId^% vGridLineId
)
member GetRefGridLines :
        uGridLineId : ElementId byref *
        vGridLineId : ElementId byref -> unit
Parameters
uGridLineId ElementId
vGridLineId ElementId
See Also
Reference
Panel Class
Autodesk.Revit.DB Namespace